Titanic veri seti üzerinden soruları çözeceğiz.

Link: https://www.kaggle.com/c/titanic/data

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(r'C:\Users\sakir\OneDrive\Masaüstü\career\patika.dev\train.csv')

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
# Kazada ölenlerin yaş ortalamasını bulunuz
df[df['Survived'] == 0]['Age'].mean()

np.float64(30.62617924528302)

In [7]:
# Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz
df[df['Survived'] == 0]['Fare'].mean()
df[df['Survived'] == 0]['Fare'].median()

np.float64(10.5)

In [8]:
# Kazada ölen erkeklerin yaş ortalamasını bulunuz
df[(df['Survived'] == 0) & (df['Sex'] == 'male')]['Age'].mean()

np.float64(31.618055555555557)

In [9]:
# Kazada ölen Kadınların yaş ortalamasını bulunuz
df[(df['Survived'] == 0) & (df['Sex'] == 'female')]['Age'].mean()

np.float64(25.046875)

In [10]:
# Kazadan kurtulanların yaş ortalamasını bulunuz
df[df['Survived'] == 1]['Age'].mean()

np.float64(28.343689655172415)

In [11]:
# Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz
df[df['Survived'] == 1]['Fare'].mean()

np.float64(48.39540760233918)

In [12]:
# Kazadan kurtulan toplam kişi sayısını bulunuz…
# Kazadan kurtulan toplam kişi sayısını bulunuz…
# (tüyo: len(df_titanic[(df_titanic.Survived==1)]   kodu ile de bu sayıya ulaşabilirsiniz.)
df[df['Survived'] == 1].shape[0]
len(df[(df.Survived==1)])

342

In [13]:
# 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz
df[df['Age'] < 10]['Fare'].median()

np.float64(27.0)

In [14]:
# 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız.
# (Pclass değişkeni sınıfları barındırmaktadır.)
df.groupby('Pclass')['Fare'].agg(['mean', 'median'])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [15]:
# Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız.
# (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.
len(df[(df.Survived==0) & (df.Sex=='male')]) / len(df[(df.Sex=='male')])
len(df[(df.Survived==0) & (df.Sex=='female')]) / len(df[(df.Sex=='female')])

0.25796178343949044